Revit 2027 API
PointLightShape Constructor
 Creates a point light shape object.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointLightShape()
Public Sub New
public:
PointLightShape()
new : unit -> PointLightShape
See Also
Reference
PointLightShape Class
PointLightShape Overload
Autodesk.Revit.DB.Lighting Namespace